import 'package:flutter/material.dart';
import 'package:healthify/src/constants/colors.dart';
import 'package:healthify/src/localization/app_strings_extension.dart';
import 'package:healthify/src/presentation/widgets/default_app_text.dart';

class TermsScreen extends StatelessWidget {
  const TermsScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        leading: IconButton(
          onPressed: () => Navigator.pop(context),
          icon: const Icon(
            Icons.arrow_back,
            color: AppColors.defaultWhite,
          ),
        ),
        elevation: 0,
        backgroundColor: AppColors.primary,
        centerTitle: true,
        title: Text(
          context.terms,
          style: const TextStyle(
            fontSize: 14,
            color: AppColors.defaultWhite,
            fontWeight: FontWeight.w500,
            fontFamily: "Alexandria",
          ),
        ),
      ),
      body: const SingleChildScrollView(
        padding: EdgeInsets.all(16),
        child: DefaultAppText(
          text: """
شكرا لاستخدامك خدماتنا. و من أجل تنظيم العلاقة الناتجة عن استخدامك لموقع sehtak.com.eg("الموقع")، أو تطبيقنا صحتك تهمنا، ("التطبيق") والخدمات التي تقدمها صحتك تهمنا، تشكل شروط الاستخدام هذه ("الشروط") اتفاقية ملزمة قانونًا بينك، إما بصفتك فردًا أو نيابة عن منظمة أو كيان تمثّله قانونًا ("أنت" ، "الخاص بك" ، "لك") ، و شركة صحتك تهمنا ذات المسؤولية المحدودة ، مالك ومشغل موقع صحتك تهمنا ،("صحتك تهمنا"، "نحن" ، "لدينا"). تُطبق هذه الشروط على جميع مستخدمي الموقع، بما في ذلك على سبيل المثال لا الحصر المتصفحات و / أو البائعين و / أو العملاء و / أو مقدمي الخدمات و / أو المساهمين في المحتوى ("المستخدمون"). ولعلك تدرك أن صحتك تهمنا أو أي من الشركات التابعة لها تحتفظ بالحق في تقييد أو وقف استخدامك للخدمات عبر الإنترنت إذا كنت لا تلتزم بهذه الشروط أو وفقًا لتقدير صحتك تهمنا وحدها. من خلال الوصول إلى الموقع أو التطبيق أو استخدام أي جزء منهما، فإنك توافق على أنك قد قرأت وفهمت ووافقت على الالتزام بهذه الشروط ، بالإضافة إلى الإرشادات أو السياسات أو القواعد الإضافية المتاحة كما هو معمول به على الموقع والتطبيق ، بما في ذلك ، على سبيل المثال لا الحصر ، سياسة الخصوصية لصحتك تهمنا ، والتي تم دمجها بالإشارة إلى هذه الشروط. إذا كنت لا توافق على الالتزام بهذه الشروط وعلى اتباع جميع القوانين والمبادئ التوجيهية والسياسات المعمول بها ، فلا تدخل إلى الموقع أو تستخدمه.


  1. طبيعة المحتوى الذي يظهر على خدماتنا
1.1 نظرة عامة قد تتضمن خدماتنا نصًا أو بيانات أو رسومات أو صورًا أو أي محتوى آخر (يُشار إليه إجمالاً باسم "المحتوى") أنشأناه بمعرفتنا أو من قبل الغير، بما في ذلك المتعاقدين للتسويق مع صحتك تهمنا من مقدمي الرعاية الصحية والشركاء (المستشفيات – العيادات – المراكز الطبية التخصصية – الصيدليات – مراكز الأشعة – مراكز التحاليل – مراكز البصريات والمستلزمات الطبيه)
1.2 خدماتنا تشمل هذا الموقع والتطبيق مما يتيح للمستخدمين التعرف على مقدمي الرعاية الصحية والحجز لديهم والاستفادة من الخصومات المجانية علي كافة الخدمات الطبية المقدمة. يُشار إلى خدماتنا العامة والمحمية إجمالًا باسم "الخدمات". بمعنى آخر ، تهدف خدماتنا فقط إلى مساعدتك في البحث وحجز موعد مع مقدم الخدمة والاستفادة من كافة الخصومات المجانية . أنت تعلم بأن بعض الخدمات متاحة تحت أسماء مختلفة . 
1.2.1 الخدمات العامة نُتيح بعض الخدمات بدون تسجيل أو كلمة مرور. و نُطلق عليها "الخدمات العامة". يجوز لك استخدام الخدمات العامة بشكل شخصي غير تجاري طالما أنك تمتثل لهذه الشروط. تتضمن هذه الخدمات دلائل ("الدلائل") (المستشفيات – العيادات – المراكز الطبية التخصصية – الصيدليات – مراكز الأشعة – مراكز التحاليل – مراكز البصريات والمستلزمات الطبيه)، يُشار إليها إجمالًا باسم ("مقدمو الخدمات"). حيث يتم تقديم هذه الدلائل لراحتك. تشمل الدلائل فقط مقدمي الخدمات الذين يستخدمون خدماتنا والذين اختاروا المشاركة في الدلائل. لا يشكل إدراج مقدم الخدمات في الدلائل توصية لخدمات مقدم الخدمة هذا أو ضمانًا لشهاداته أو مؤهلاته. نظرًا لأن جميع المعلومات يتم نقلها على النحو الذي قدمه مقدمو الخدمات ، وبينما نبذل جهودًا معقولة لتزويدك بمحتوى دقيق ، فإننا لا نضمن ، أو نمثل ، أو نكفل دقة أي معلومات فيما يتعلق بالمؤهلات المهنية ، الخبرات أو جودة العمل أو معلومات السعر أو التكلفة أو التأمين أو أي محتوى آخر متاح من خلال الخدمات، سواء كانت صريحة أو ضمنية. و لن نتحمل بأي حال من الأحوال المسؤولية تجاهك أو تجاه أي شخص آخر عن أي قرار أو إجراء تتخذه اعتمادًا على أي محتوى من هذا القبيل. نحن لا نؤيد أو نوصي بأي شكل من الأشكال بأي فرد أو كيان مُدرج أو يمكن الوصول إليه من خلال الخدمات. بينما يمكن إجراء الحجوزات من خلال التطبيق فقط ، لا يمكننا ضمان توافر مقدم الخدمات ذي الصلة ، ولا يمكننا توقع إلغاء مواعيده.
2.2.1 الخدمات المحمية بعض خدماتنا محمية بواسطة تدابير تقنية تهدف إلى حماية سرية المعلومات الحساسة وسلامتها وإمكانية الوصول إليها و التي يقوم المستخدمون بتخزينها ومشاركتها باستخدام خدماتنا؛ و نُطلق عليها "الخدمات المحمية". تتطلب هذه الضمانات من كل مستخدم المصادقة بشكل صحيح عن طريق التفويض ("بيانات الاعتماد") ، مثل المعرفات الفريدة وأسماء المستخدمين وكلمات المرور وما شابه. و من أجل الحصول على بيانات الاعتماد ، يجب عليك تقديم معلومات معينة عن نفسك. إذا كنت تقوم بالتسجيل في خدمة محمية ، أو تقوم بالوصول إلى خدمة محمية أو استخدامها ، أو تحاول الوصول إليها أو استخدامها ، نيابة عن ، أو لصالح ، شخص آخر غيرك - مثل أي من أفراد عائلتك ("الفاعل الأصلي") - يجب عليك أيضًا تحديد وتقديم معلومات حول كل فاعل. تمت الإشارة إلى الشروط والأحكام الأخرى المتعلقة بتسجيل المستخدم في القسم 6. هذه الخدمات المحمية هي جميع الخدمات التي تُنشئ لك سجلاً طبيًا شخصيًا ("السجل الطبي") ، مثل تلقي معلوماتك الطبية والنتائج من مقدمي الخدمات مثل المختبرات ومراكز الأشعة وحسابات الأطباء. هذه البيانات خاصة ومؤمنة تمامًا ونضمن لك ذلك. تُعتبر أنت مالك البيانات الوحيد ، وبمجرد النقر على "أوافق" ، فإنك تمنح مقدمي الخدمات الحق في إرسال المعلومات إليك من خلال حسابك الخاص على التطبيق. و من أجل مساعدتك في إنشاء سجلك الطبي الإلكتروني ، يمكنك الموافقة على إرسال نسخة من هذه البيانات إلى الطبيب الذي يُقدم الخدمة من خلال خدماتنا ، والتي ستتم حمايتها والحفاظ على خصوصيتها بالإضافة إلى عدم مشاركتها مع الغير. سيحتفظ الطبيب بهذه البيانات باسمك في حسابه لإنشاء سجلك الطبي في العيادة. في حالة عدم موافقتك على الاحتفاظ بسجل طبي لبياناتك ، يمكنك إرسال طلبك إلى صحتك تهمنا لإبداء رغبتك في عدم مشاركته ، وستلتزم صحتك تهمنا بالامتثال لهذا الطلب.
1.3 المحتوى تُتيح لك خدماتنا الوصول إلى المراجعات والمنتديات الأخرى حيث يمكن لمختلف المستخدمين مشاركة المعلومات والآراء والتقييمات والمحتويات الأخرى. نحن بشكل عام لا نفرز مسبقًا المحتوى المقدم أو نتابعه ، وقد يمثل هذا المحتوى رأي المستخدم ببساطة. قد تتضمن خدماتنا أيضًا نتائج الاستبيان أو التقييمات أو الشهادات ("التقييمات") من المستخدمين الذين قد يؤيدون أو يوصون أو ينتقدون أو يحللون أو يقيّمون أو يوضحون بطريقة أخرى مقدمي الخدمات وطبيعة الخدمات أو جودتها التي يتلقاها هذا المستخدم. هذه التقييمات هي حسابات قصصية مباشرة للمستخدمين الفرديين ، ولا تشكل حكم مقدم الخدمات ولا نتاج العلوم الطبية. لعلك تدرك أن التقييمات الواردة في التطبيق هي من أولئك الذين يقدمونها ، وأنها لا تعكس آراء صحتك تهمنا ، ولا تشكل بأي حال من الأحوال تأييدنا أو توصيتنا لها. وبالتالي ، لن تتحمل صحتك تهمنا أي مسؤولية عن أي من التقييمات المنشورة. علاوة على ذلك ، يجب أن تضع في اعتبارك أن التقييمات عُرضة للأخطاء والتحيزات الشائعة في الحسابات القصصية المباشرة ، ولا يُفترض أن تكون موثوقة أو خالية من الأخطاء. أي محتوى تحصل عليه أو تستقبله من صحتك تهمنا أو موظفيها أو المقاولين أو الشركاء أو الرعاة أو المعلنين أو المرخصين أو غير ذلك من خلال الخدمات ، هو لأغراض إعلامية و أغراض التنظيم والدفع فقط. حيث أن جميع المعلومات للأغراض الإعلامية فقط ، ولا تشكل مشورة طبية. ولا تُعتبر المعلومات المعروضة على التطبيق بديلاً عن المشورة الطبية من قبل متخصصي الرعاية الصحية المؤهلين. فإذا كنت تعتمد على أي محتوى ، بما في ذلك المراجعات ، فأنت تقوم بذلك على مسؤوليتك الخاصة. لذلك نشجعك على تأكيد أي محتوى ذي صلة بك بشكل مستقل مع مصادر أخرى ، بما في ذلك مقرات مقدمي الرعاية الصحية ، والجمعيات الطبية ذات الصلة بالتخصص المُطبق ، والمجالس الطبية في الدولة ، وسلطات الترخيص أو التصديق المناسبة للتحقق من بيانات الاعتماد والتعليم المُدرجة.




2.  سياسة الخصوصية والأمان
1.2 تعتبر صحتك تهمنا والشركات التابعة لها أن خصوصية معلوماتك الصحية من أهم العناصر في علاقتنا معك. مسؤوليتنا في الحفاظ على سرية معلوماتك الصحية هي مسؤولية نأخذها على محمل الجد. نحن مطالبون بموجب القانون بالحفاظ على خصوصية وأمان معلوماتك الصحية المحمية. سنخبرك على الفور في حالة حدوث خرق قد يكشف عن خصوصية أو أمان معلوماتك. و لن نستخدم أو نشارك معلوماتك بخلاف ما هو موضح هنا. حيث تُعتبر أنت مالك البيانات الوحيد و تشاركها عندما ترغب من خلال موقعنا.
2.2 لمزيد من الحماية لسرية المعلومات وسلامتها وتوافرها على صحتك تهمنا ومشاركتها ، بالإضافة إلى استقرار خدماتنا ، فإنك توافق على الضمانات الإضافية التالية. وبناءً على ذلك ، فإنك توافق على أنك لن تفعل ولن تحاول:
• الوصول إلى خدماتنا أو استخدامها أو نشرها أو أي معلومات أو ملفات يمكن الوصول إليها عبر خدماتنا ، بطريقة تنتهك القوانين واللوائح المعمول بها أو حقوق أي فرد أو كيان
• بيع أو تحويل أي معلومات مُدرجة في خدماتنا أو استخدام تلك المعلومات لتسويق أي منتج أو خدمة - بما في ذلك عن طريق إرسال أو تسهيل إرسال رسائل البريد الإلكتروني غير المرغوب فيها أو الرسائل الاقتحامية (SPAM) ؛
• بحث أو فحص أو اختبار نقاط الضعف في خدماتنا ، أو النظام أو الشبكة التي تدعم خدماتنا ، أو التحايل على التدابير الأمنية أو المصادقة ؛
• تعطيل أو إغفال أو تجاوز أو تجنب أو إزالة أو إلغاء تنشيط أو التحايل بطريقة أخرى على أي تدابير فنية نُجريها لحماية استقرار خدماتنا ، أو سرية أو سلامة أو توافر أي معلومات أو محتوى أو بيانات موجودة في خدماتنا ؛
• تقديم خدماتنا لأي برنامج أو رمز أو أي جهاز آخر (1) يسمح بأي طريقة بالوصول غير المصرح به إلى أنظمتنا أو أي برامج أو أجهزة أو ملفات أو بيانات موجودة عليها ، (2) تعطيل أو إتلاف أو التدخل أو التأثير سلبًا على تشغيل أنظمتنا أو أي برامج أو أجهزة أو ملفات أو بيانات موجودة عليها ، أو (3) يثقل أو يتداخل مع الأداء الوظيفي لخدماتنا ؛
• تفكيك أو عكس هندسة خدماتنا ؛
• الحصول على أو استرداد أو فهرسة أو نشر أي جزء من خدماتنا ما لم تكن محرك بحث عام يشارك في خدمات البحث العامة ؛
• تعطيل أو التحايل على ضمانات استخدام واجهة برمجة التطبيقات لدينا ، بما في ذلك الضمانات المصممة لتنظيم طبيعة أو مقدار البيانات التي يُسمح لك باستخراجها من خدماتنا ، أو تكرار الوصول إلى هذه البيانات ؛ أو إجراء مكالمات إلى واجهة برمجة التطبيقات الخاصة بنا بخلاف تلك المصرح بها في وثائق واجهة برمجة التطبيقات لدينا ؛
• إزالة أي حقوق نشر أو علامة تجارية أو إشعارات حقوق الملكية الأخرى الواردة في خدماتنا أو 
• المشاركة في أي نشاط آخر غير المسموح به صراحةً في هذه الشروط.

3. الدفع
3.1 تحصيل المدفوعات
3.1.1 يمكنك اختيار إما (1) الدفع نقدًا أو (2) الدفع عبر الإنترنت من خلال موقعنا أو تطبيقنا. عند تحصيل المبالغ نيابة عن مقدمي الخدمات ، فإنك توافق صراحًة على الالتزام بشروط الدفع الخاصة بمقدم الخدمة هذا. و عند الاقتضاء ، سنقوم بتضمين أية ضرائب. نقبل حاليًا الدفع من خلال بطاقات الائتمان / الخصم أو خدمة فوري أو المحافظ الرقمية. أنت توافق على إجراء جميع هذه المدفوعات في الوقت المناسب ، وتقر بأنك مسؤول عن أي مبالغ مرتبطة بحسابك. و اعتمادًا على الخدمة ، سنقوم بتحصيل المدفوعات قبل أو بعد تقديم الخدمة.
3.1.2 نحتفظ بالحق في تحديد أو تعديل أو إزالة أي رسوم ، وفقًا لتقديرنا الخاص. قد نقدم أيضًا عروضًا ترويجية أو خصومات ، والتي ستغير المبلغ المدفوع ، ولكن تخضع فقط لشروط وأحكام هذا العرض الترويجي أو الخصم.
3.2 سياسة الاسترداد
3.2.1 الرسوم التي تدفعها نهائية وغير قابلة للاسترداد ، ما لم تحدد صحتك تهمنا خلاف ذلك.
3.2.2 تُسترد الأموال بنفس طريقة الدفع ، إن وُجدت.
3.2.3 تحتفظ صحتك تهمنا بحقها في استرداد أي مبالغ إلى حساب المستخدمين لاستخدامها في خدمات أخرى وفقًا لتقديرها الخاص.
3.2.4 المبالغ المُستردة غير قابلة للتطبيق إذا كان المستخدم غير راضٍ عن الخدمة الطبية المُقدمة.
3.2.5 يحق للمستخدم استرداد كامل المبلغ إذ ألغت المؤسسة الطبية الخدمة الطبية المقدمة التي دفع المستخدم من أجلها. 




 .4 الامتثال
 4.1 يتعين عليك الامتثال لهذه الشروط وأي سياسات مُشار إليها على الموقع وأي قوانين أو لوائح أو قواعد أو تراخيص أو قيود معتمدة من قبل صحتك تهمنا.
 .5 الترخيص
 5.1 وفقًا لهذه الشروط ، تُمنح حقًا محدودًا وقابل للإلغاء وغير حصريًا لاستخدام الخدمات والمحتوى والمواد الموجودة على الموقع في السياق العادي لاستخدامك للموقع. لا يجوز لك استخدام الملكية الفكرية للغير دون إذن كتابي صريح منه.
 5.2 تحتفظ صحتك تهمنا بملكية حقوق الملكية الفكرية الخاصة بها ولا يجوز لك الحصول على أي حقوق بموجب هذه الشروط أو غير ذلك ، باستثناء ما هو منصوص عليه صراحةً في هذه الشروط. ولا يحق لك استخدام أو نسخ أو عرض أو أداء أو إنشاء أعمال مشتقة أو توزيع أو نقل أو ترخيص من الباطن من المواد أو المحتوى المتاح على الموقع ، مما قد يكون ضروريًا بشكل معقول لاستخدام الخدمات للغرض المقصود منها وباستثناء ما هو منصوص عليه صراحًة في هذه الشروط.
 .6تسجيل المستخدم
 6.1 ليس عليك التسجيل من أجل زيارة الموقع. للوصول إلى ميزات معينة في الخدمات ، ستحتاج إلى التسجيل في صحتك تهمنا وإنشاء ("حساب مستخدم") من خلال عملية التسجيل عبر الإنترنت على التطبيق. يمنحك حسابك إمكانية الاستفادة من كافة الخصومات المجانية المقدمة من جميع أنواع المؤسسات الطبية (المستشفيات – العيادات – المراكز الطبية التخصصية – الصيدليات – مراكز الأشعة – مراكز التحاليل – مراكز البصريات والمستلزمات الطبيه). عند إنشاء حساب ، يجب عليك تزويد صحتك تهمنا بمعلومات تسجيل دقيقة وكاملة ، كما هو مطلوب في استمارة التسجيل. عليك إخطار صحتك تهمنا على الفور إذا تغير أي من هذه المعلومات. و إذا فشلت في تقديم هذه المعلومات أو تحديثها ، فلن تتمكن من تلقي المعلومات المطلوبة من خلال الموقع. و يحق لصحتك تهمنا أيضًا إنهاء أو منع استخدامك للخدمات.
 6.2 و بمجرد إنشاء حساب ، يُطلب منك الموافقة صراحةً على هذه الشروط. و تُقر أيضًا بأن عمرك يتجاوز 18 عامًا للاستفادة من خدماتنا ، وأننا لا نتحمل المسؤولية عن استخدام خدماتنا إذا كان عمرك أقل من 18 عامًا.
6.3  من خلال الوصول إلى خدماتنا واستخدامها ، فإنك توافق على استخدامنا لعنوان بريدك الإلكتروني لإرسال إشعارات متعلقة بالخدمة أو تغيير الميزات أو العروض الخاصة بما في ذلك أي إشعارات مطلوبة بموجب القانون ، بدلاً من الاتصال بالبريد العادي.
7. دقة المعلومات واكتمالها و حداثتها
 7.1 لسنا مسؤولين إذا كانت المعلومات المتوفرة على هذا الموقع غير دقيقة أو كاملة أو حديثة. يتم توفير المواد الموجودة على هذا الموقع للحصول على معلومات عامة فقط ولا ينبغي الاعتماد عليها أو استخدامها كأساس وحيد لاتخاذ القرارات دون استشارة مصادر المعلومات الأولية أو الأكثر دقة أو الأكثر اكتمالًا أو الأكثر حداثة. يكون أي اعتماد على المواد الموجودة على هذا الموقع على مسؤوليتك الخاصة.
7.2 قد يحتوي هذا الموقع على معلومات تاريخية معينة. ليست بالضرورة أن تكون المعلومات التاريخية حديثة ولكن يتم توفيرها كمرجع لك فقط. نحتفظ بالحق في تعديل محتويات هذا الموقع في أي وقت ، لكننا لسنا ملزمين بتحديث أي معلومات على موقعنا. و توافق على أنه من مسؤوليتك مراقبة التغييرات على موقعنا.
8. الأدوات الاختيارية
 8.1 قد نوفر لك إمكانية الوصول إلى أدوات الغير التي لا نراقبها ولا نملك أي سيطرة عليها.
8.2 تُقر وتوافق على أننا نوفر الوصول إلى هذه الأدوات "كما هي" و "كما هي متوفرة" دون أي ضمانات أو إقرارات أو شروط من أي نوع ودون أي مصادقة. و لن نتحمل أي مسؤولية من أي نوع تنشأ عن أو تتعلق باستخدامك للأدوات الاختيارية التابعة للغير.
8.3 أي استخدام من جانبك للأدوات الاختيارية المقدمة من خلال الموقع يكون على مسؤوليتك الخاصة وتقديرك تمامًا ، ويجب عليك التأكد من أنك على دراية بالشروط التي يتم توفير الأدوات من خلالها والموافقة عليها من قبل مقدمي خدمات الأطراف الثالثة ذي الصلة.
8.4 قد نقدم أيضًا ، في المستقبل ، خدمات و / أو ميزات جديدة من خلال موقع الويب (بما في ذلك ، إصدار أدوات وموارد جديدة). تخضع هذه الميزات و / أو الخدمات الجديدة أيضًا لشروط الخدمة هذه.
9.  روابط الغير
9.1 قد تشتمل بعض المحتويات والمنتجات والخدمات المتوفرة عبر موقعنا على مواد من الأطراف الثالثة. قد توجهك روابط الغير الموجودة على هذا الموقع إلى مواقع ويب تابعة لأطراف ثالثة غير تابعة لنا.
9.2 لسنا مسؤولين عن فحص أو تقييم المحتوى أو دقته ولا نضمن ولن نتحمل أي مسؤولية عن أي مواد أو مواقع خاصة بطرف ثالث ، أو عن أي مواد أو منتجات أو خدمات أخرى لأطراف ثالثة.
9.3 لسنا مسؤولين عن أي ضرر أو تلف يتعلق باستخدام الخدمات أو الموارد أو المحتوى أو أي معاملات أخرى تتم فيما يتعلق بأي مواقع ويب تابعة لأطراف ثالثة. يُرجى مراجعة سياسات وممارسات الطرف الثالث بعناية والتأكد من فهمك لها قبل الدخول في أي معاملة. تُوجه الشكاوى أو المطالبات أو المخاوف أو الأسئلة المتعلقة بمنتجات الطرف الثالث إلى الطرف الثالث نفسه.

10. تعليقات المستخدم والملاحظات والاقتراحات الأخرى
10.1 إذا قمت ، بناءً على طلبنا ، بإرسال بعض المقترحات المحددة (على سبيل المثال خانات المسابقات) أو دون طلب منا ، فإنك ترسل أفكارًا أو اقتراحات أو مقترحات أو خططًا إبداعية أو مواد أخرى ، سواء عبر الإنترنت أو عبر البريد الإلكتروني أو البريد العادي أو غير ذلك. (يُشار إليها إجمالاً باسم ، "التعليقات") ، و توافق على أنه يجوز لنا ، في أي وقت ، دون قيود ، تعديل ونسخ ونشر وتوزيع وترجمة واستخدام أي تعليقات ترسلها إلينا بأي وسيلة أخرى. ولسنا ملزمين (1) بالحفاظ على سرية أي تعليقات ؛ (2) بدفع تعويض عن أي تعليقات ؛ أو (3) بالرد على أي تعليقات.
10.2 يجوز لنا ، ولكننا غير ملزمين بمراقبة أو تعديل أو إزالة المحتوى الذي نحدده وفقًا لتقديرنا الخاص بأنه غير قانوني أو مسيء أو مهدد أو تشهيري أو قذفي أو فاحش أو ينتهك الملكية الفكرية لأي طرف أو شروط الاستخدام هذه.
10.3 توافق على عدم انتهاك تعليقاتك لأي حق لأي طرف ثالث ، بما في ذلك حقوق النشر أو العلامات التجارية أو الخصوصية أو الشخصية أو أي حقوق شخصية أو حقوق ملكية أخرى. و توافق أيضًا على عدم احتواء تعليقاتك على مواد تشهيرية أو غير قانونية أو مسيئة أو فاحشة ، أو تحتوي على أي فيروسات للحاسوب أو برامج ضارة أخرى يمكن أن تؤثر بأي شكل من الأشكال على تشغيل الخدمة أو أي موقع ويب ذي صلة. لا يجوز لك استخدام عنوان بريد إلكتروني مزيف ، أو التظاهر بأنك شخص آخر غيرك ، أو تضليلنا أو تضليل الغير فيما يتعلق بأي تعليقات. أنت وحدك المسؤول عن أي تعليقات تنشرها و مسؤول أيضًا عن دقتها. ولا نتحمل أي مسؤولية عن أي تعليقات تنشرها أو ينشرها الغير.
11. الأخطاء وعدم الدقة والسهو
11.1 أحيانًا ، قد تكون هناك معلومات على موقعنا تحتوي على أخطاء مطبعية أو عدم دقة أو سهو قد يتعلق بأوصاف المنتج ، والتسعير ، والعروض الترويجية ، والعروض ، ورسوم شحن المنتج ، وأوقات الانتقال والتوافر. نحتفظ بالحق في تصويب أي أخطاء أو عدم دقة أو سهو و تغيير المعلومات أو تحديثها و إلغاء الطلبات إذا كانت أي معلومات في الخدمة أو على أي موقع إلكتروني ذي صلة غير دقيقة في أي وقت دون إشعار مسبق.
12. الاستخدامات المحظورة
12.1  بالإضافة إلى المحظورات الأخرى المنصوص عليها في هذه الشروط ، يُحظر عليك استخدام الموقع أو تطبيقنا أو محتواه: (أ) لأي غرض غير قانوني ؛ (ب) تحريض الآخرين على المشاركة في أي أعمال غير قانونية ؛ (ج) انتهاك أي لوائح أو قواعد أو قوانين أو مراسيم محلية أو دولية أو فيدرالية أو إقليمية أو خاصة بالولاية ؛ (د) التعدي على أو انتهاك حقوق الملكية الفكرية الخاصة بنا أو حقوق الملكية الفكرية للآخرين ؛ (هـ) المضايقة أو الإساءة أو الإهانة أو الأذى أو التشهير أو الاستخفاف أو التخويف أو التمييز على أساس الجنس أو الميول الجنسية أو الدين أو العرق أو السلالة أو السن أو الأصل القومي أو الإعاقة ؛ (و) تقديم معلومات خاطئة أو مضللة ؛ (ز) لتحميل أو نقل فيروسات أو أي نوع آخر من الشفرات الخبيثة التي ستستخدم أو يمكن استخدامها بأي طريقة من شأنها التأثير على وظيفة أو تشغيل الخدمة أو أي موقع ويب ذي صلة أو مواقع ويب أخرى أو الإنترنت ؛ (ح) لجمع أو تتبع المعلومات الشخصية للآخرين ؛ (ط) إرسال بريد عشوائي أو التصيد الاحتيالي أو التحجج الاحتيالي أو زحف الشبكة ؛ (ي) لأي غرض فاحش أو غير أخلاقي ؛ أو (ك) للتدخل أو التحايل على ميزات الأمان للخدمة أو أي موقع ويب ذي صلة أو مواقع ويب أخرى أو الإنترنت. و نحتفظ بالحق في إنهاء استخدامك للخدمة أو أي موقع ويب ذي صلة لانتهاك أي من الاستخدامات المحظورة.



13. إخلاء المسؤولية عن الضمانات وحدود المسؤولية
13.1 لا نضمن أن استخدامك لخدمتنا سيكون دون انقطاع أو مناسبًا أو آمنًا أو خاليًا من الأخطاء. بينما نسعى دائمًا للتأكد من أن مقدمي الخدمات مرخصون حسب الأصول في الاختصاص ذي الصلة ، و لا نضمن أن يكون المحتوى الخاص بنا دائمًا خاليًا من الأخطاء أو كاملًا أو دقيقًا أو مُحدثًا.
13.2 لا نضمن أن النتائج التي قد تحصل عليها من استخدام الخدمة ستكون دقيقة أو موثوقة.
13.3 توافق على أنه من حين لآخر قد نمحي الخدمة لفترات زمنية غير مُحددة أو إلغاء الخدمة في أي وقت دون إخطارك.
13.4 توافق صراحًة على أن استخدامك للخدمة أو عدم قدرتك على استخدامها يكون على مسؤوليتك الخاصة. تُقدم الخدمات وجميع المنتجات والخدمات المقدمة لك من خلال الخدمة (باستثناء ما هو مذكور صراحًة من قبلنا) "كما هي" و "كما هي متوفرة" لاستخدامك ، دون أي إقرارت أو ضمانات أو شروط من أي نوع ، سواء كانت صريحة أو ضمنية ، بما في ذلك جميع الضمانات الضمنية أو شروط صلاحية العرض في السوق والجودة التجارية والملاءمة لغرض معين و الاستمرارية والملكية وعدم الانتهاك.
13.5  لن نتحمل بأي حال من الأحوال و مديرينا أو مسؤولينا أو موظفينا أو الشركات التابعة لنا أو الوكلاء أو المقاولين أو الأطباء المقيمون أو الموردين أو مقدمي الخدمات أو المرخصين المسؤولية عن أي إصابة أو خسارة أو مطالبة أو أي ضرر مباشر أو غير مباشر أو عرضي أو تأديبي أو خاص أو أضرار تبعية من أي نوع ، بما في ذلك ، على سبيل المثال لا الحصر ، خسارة الأرباح ، أو خسارة الإيرادات ، أو خسارة المدخرات ، أو فقدان البيانات ، أو تكاليف الاستبدال ، أو أي أضرار مماثلة ، سواء كانت قائمة في العقد ، أو الضرر (بما في ذلك الإهمال) ، أو المسؤولية التامة أو غير ذلك ، الناشئة عن استخدامك لأي من الخدمات أو أي منتجات تم شراؤها باستخدام الخدمة أو لأي مطالبة أخرى تتعلق بأي شكل من الأشكال باستخدامك للخدمة أو أي منتج ، بما في ذلك ، على سبيل المثال لا الحصر ، أي أخطاء أو سهو في أي محتوى ، وأي تشخيصات أو المشورة الطبية أو الوصفات الطبية أو أي خسارة أو ضرر من أي نوع يحدث نتيجة لاستخدام الخدمة أو أي محتوى (أو منتج) يتم نشره أو نقله أو إتاحته بطريقة أخرى عبر الخدمة ، حتى لو تم التنبيه بإمكانية حدوث ذلك.
13.6 لا تتحمل صحتك تهمنا المسؤولية عن أي أضرار تلحق بك بما في ذلك على سبيل المثال لا الحصر، الأضرار المباشرة أو غير المباشرة أو الخاصة أو التبعية أو التأديبية أو العرضية ، الناشئة عن أو فيما يتعلق بأي من الأفعال التالية التي يرتكبها مقدمو الخدمة:
• الإخفاق في تقديم آداب معاملة المريض؛
• السلوك غير المهني أو غير الأخلاقي أو الُمشين ؛
• التشخيص الخاطئ أو المتأخر للحالة طبية ؛
• العلاج الخاطئ أو المتأخر أو عدم وجود علاج على الإطلاق؛
• سوء الممارسة الطبية أو الإهمال ؛
• إلغاء الموعد أو تأخر مقدم الخدمة أو عدم الحضور على الإطلاق إلى موعد الفحص.
نحن لا نقدم المشورة الطبية أو التشخيص أو العلاج، و لا ندعم ولا نوصي بـ مقدم خدمة مُعين، ولا ننوي ممارسة الطب. ولكن نود مساعدتك فقط في البحث عن أفضل مقدم للخدمة وحجز موعد وفقًا لاحتياجاتك الطبية والاستفادة من كافة الخصومات الطبية المجانية المتاحة . لذلك ، من الضروري أن تتوخى نفس الحذر و تتخذ الحيطة التي كنت ستطبقها حتى لو لم تكن تستخدم خدماتنا. أنت تدرك وتقر بأن صحتك تهمنا لن تكون مسؤولة عن أي أضرار أو وفيات أو إصابات أو أمراض أو خسائر أو تكاليف أو مصروفات مهما كانت طبيعتها الناجمة عن مقدم الخدمة.

14. التعديل
14.1 تتغير تقنية الإنترنت والقوانين والقواعد واللوائح المعمول بها بشكل متكرر. و عليه ، تحتفظ صحتك تهمنا بالحق في إجراء تغييرات على هذه الشروط في أي وقت. حيث يُشكل استمرار استخدامك للموقع موافقة على أي حكم جديد أو مُعدل من هذه الشروط قد يتم نشره على الموقع. سننشر الشروط المُعدلة على هذه الصفحة ونشير في أعلى الصفحة إلى آخر تاريخ لمراجعة لهذه الشروط.
15. اختيار القانون
15.1 تخضع هذه الشروط وجميع الدعاوى والإجراءات الواردة أدناه وتُفسر وفقًا لقوانين جمهورية مصر العربية. كما تخضع بشكل صريح وغير قابل للإلغاء للاختصاص القضائي الحصري لمحاكم القاهرة و مصر وتتنازل عن أي دعاوى تتعلق بمكان محاكمة غير ملائم.



 16. أحكام متنوعة
16.1 لعلك تدرك أنه قد يتم إلغاء تنشيط حسابك أو استخدامك للموقع / التطبيق أو إنهاؤه بناءً على طلبك أو وفقًا لتقدير صحتك تهمنا أو أي من الشركات التابعة لها لعدم الالتزام بهذه الشروط.
16.2 يجوز لنا التنازل عن هذه الشروط بحرية فيما يتعلق بدمج الأصول أو الاستحواذ عليها أو بيعها ، أو بموجب القانون أو لأي سبب آخر.
 16.3 في حالة أصبح أي حكم من هذه الشروط غير قانوني أو باطل أو غير قابل للتنفيذ ، يكون هذا الحكم قابلاً للتنفيذ إلى أقصى حد يسمح به القانون المعمول به ، ويُعتبر الجزء غير القابل للتنفيذ منفصلًا عن شروط الخدمة هذه ، ولا يؤثر هذا على صلاحية وإنفاذ أي من الأحكام الأخرى.
16.4 لا يشكل إخفاقنا في ممارسة أو إنفاذ أي حق أو حكم من هذه الشروط تنازلاً عن هذا الحق أو الحكم.
16.5 تشكل هذه الشروط ، جنبًا إلى جنب مع اتفاقية المستخدم النهائي وسياسة الخصوصية ، الاتفاقية الكاملة بينك وبين صحتك تهمنا فيما يتعلق بأي خدمات نقدمها ، وتحل محل جميع الاتصالات أو الإقرارات أو التفاهمات السابقة ، سواء كانت شفهية أو مكتوبة ، فيما يتعلق بموضوع الاتفاقية.

17. الشروط والأحكام الخاصة بالدفع عبر الإنترنت
تشكل شروط الدفع عبر الإنترنت عقدًا بينك وبين صحتك تهمنا. يرجى قراءتها بعناية. يمكنك قبول تلك الشروط أو رفضها كما هو موضح في أسفل هذه الصفحة، ولكن لإجراء الدفع باستخدام الخدمات، يجب عليك قبول الشروط بالنقر على "أوافق". تخضع جميع مدفوعات فواتير صحتك تهمنا باستخدام بطاقات الائتمان عبر الإنترنت للشروط التالية.
تقبل صحتك تهمنا البطاقات التالية:
• ماستر كارد
• فيزا
أنت تضمن ما يلي:
• تبلغ من العمر 18 عامًا أو أكثر.
• لديك الأهلية لقبول شروط الدفع عبر الإنترنت بشكل صحيح وستكون قادرًا على الوفاء بالتزاماتك فيما يتعلق بهذه الشروط وستفي بها.
• تم إصدار بطاقة الائتمان المستخدمة فيما يتعلق بالخدمات باسمك أو أنك مخول باستخدام بطاقة الائتمان.
• ستدفع لمصدر بطاقة الائتمان جميع الرسوم المتكبدة في استخدام الخدمات.
• المعلومات التي قدمتها صحيحة ودقيقة.
عند استكمال نموذج الدفع عبر الإنترنت، سيتم خصم المبلغ من بطاقتك الائتمانية بعملة الجنيه المصري. يتم خصم جميع المدفوعات لمصلحة صحتك تهمنا. نظرًا للطريقة التي تتم بها معالجة المعاملات من قبل المواقع المصرفية الخارجية، فقد يكون هناك تأخير في تحديث مدفوعاتك في سجلات صحتك تهمنا.
مدفوعات بطاقات الائتمان آمنة:
• ستتم معالجة المدفوعات مباشرة بواسطة Paymob.
• أرقام بطاقات الائتمان محمية بمستوى عالٍ من التشفير عند إرسالها عبر الإنترنت.
• لا تقوم صحتك تهمنا بتخزين تفاصيل بطاقتك الائتمانية بأي شكل من الأشكال.
تأكيد:
• في حالة نجاح العملية، ستتلقى إشعار تأكيد بإتمام عملية الدفع.
• في حالة عدم النجاح، سيتم إعلامك بفشل العملية. لن يتم اخطار صحتك تهمنا بسبب فشل العملية؛ لذلك، يجب عليك الاتصال بمزود بطاقة الائتمان للحصول على التفاصيل.
• في حالة فشل العملية، يرجى استخدام إحدى طرق الدفع الأخرى الموضحة في فاتورتك لسدادها. يرجى استخدام طريقة دفع بديلة على الفور لضمان استمرارية استخدام خدمات صحتك تهمنا.
• سوف تؤكد صحتك تهمنا تفاصيل الدفع الخاصة بك عبر الرسائل القصيرة.
الاسترداد:
• تتم عملية استرداد الأموال في غضون فترة زمنية معقولة، ومع ذلك، قد تواجه تأخيرًا من البنوك.
باستخدام تسهيلات بطاقات الائتمان عبر الإنترنت من صحتك تهمنا، فإنك تقبل وتوافق على تقديم بياناتك الشخصية إلى مزود الخدمة لغرض وحيد هو تقديم وإدارة الدفع عبر الإنترنت. نحن نحترم خصوصية كل فرد يزور موقعنا. تطبق مواقع صحتك تهمنا إجراءات أمنية لحماية المعلومات الخاضعة لسيطرتنا، وسوء استخدامها، وتعديلها. تخضع شروط وأحكام صحتك تهمنا الخاصة بمدفوعات بطاقات الائتمان عبر الإنترنت للتغيير في أي وقت. تخضع كل معاملة للشروط والأحكام المحددة التي كانت سارية وقت إجراء المعاملة.


اتفاقية الخصوصية للأطباء
شروط و أحكام
شكرًا لاستخدامكم خدمات "صحتك تهمنا". تشكل هذه الشروط والأحكام ("الشروط") اتفاق مُلزم قانونًا مبرم بين شركة "صحتك تهمنا" (يُشار إليها بـ "صحتك تهمنا" و/أو "نحن") وبينك بصفتك فرد مستقل، أو بالنيابة عن الكيان الذي تمثله بشكل قانوني عند الاقتضاء، أو من تستخدم هذا التطبيق لأجله (يُشار إليهم مجتمعين بـ "مقدم الخدمة" أو "أنت" أو "لك" أو "لكم").
وتشمل جميع الإشارات إلى الشروط أي شروط وإرشادات وقواعد اعتمدتها/حددتها "صحتك تهمنا". ومن خلال استخدام هذه الخدمات، أنت تُقر توافق على أن "صحتك تهمنا" ستتعامل مع استخدامك لهذه الخدمات باعتبار أنه يُعد بمثابة قبول للشروط وأنك ملتزم بالامتثال لها.
وتحكم هذه الشروط وصولك للموقع الإلكتروني: www.sehtak.com.eg واستخدامك له، بالإضافة إلى أي موقع إلكتروني آخر تملكها أو تديرها "صحتك تهمنا" أو مرخصة من قبلها أو تخضع لرقابتها (يُشار إليها مجتمعة بـ "الموقع الإلكتروني") والمنتجات والخدمات أو التطبيقات ("التطبيق") التي تقدمها أو تطورها "صحتك تهمنا" (يُشار إليها مجتمعة بـ"الخدمات"). علاوة على ذلك، تحكم هذه الشروط، بصيغتها المعدلة من حين لآخر، استخدامك لأي خدمات إلكترونية التي قد تقدمها "صحتك تهمنا" وتحصل عليها، إلى جانب أي خدمة تتطلب الاتصال بشبكة الإنترنت أو الحساب الأصلي لصحتك تهمنا أو أي حساب آخر تستخدمه للحصول على منتجات أو خدمات إلكترونية تقدمها "صحتك تهمنا".
1.  خدماتنا
1.1 تتكون خدمتنا من منصة تكنولوجية تسمح لمستخدمي تطبيق صحتك تهمنا أو موقعه الإلكتروني بالبحث عن مواعيد وحجزها لك بصفتك مقدم خدمة مستقل للرعاية الصحية ومقدمي الخدمات المشتركين في منصتنا، بما في ذلك العيادات الطبية والمستشفيات والعاملين في المجال الطبي والمختبرات وغيرها من الخدمات الصحية. بعبارة أخرى، نحن نسمح للمستخدمين بالوصول إلى مقدمي الخدمات بسهولة لتلقي العلاج الطبي.
1.2 من الضروري أن تفهم أنك مسؤول مسؤولية كاملة وحصرية عن تزويد المستخدمين بأفضل نصائح العلاج الطبي المناسب لاحتياجاتهم الطبية، وتقديم العلاج الصحيح والفعال والنصائح الطبية التي يسعون للحصول عليها من طرفك. نحن لا نمارس ولا ننوي ممارسة مهنة الطب، بل نحن نقدم المساعدة في إقامة اتصال بينك وبين المستخدمين الذين يرغبون في الحصول على استشارة طبية وعلاج مناسب. ويمكنك التواصل مع مجموعة كبيرة من المستخدمين الذين يسعون للحصول على استشارة طبية من طرفك.
1.3 هذه الخدمات غير مخصصة للاستخدام من جانبك في حال كنتَ أو الكيان الذي تنتمي إليه أو الكيان الذي تمثله غير مصرح لكم بشكل قانوني بممارسة مهنتك/مهنته أو مزاولة نشاطاتك/ نشاطاته. ومن خلال الموافقة على هذه الشروط، أنت تُقر وتضمن لصحتك تهمنا أنك والكيان الذي تنتمي إليه مرخص لك/ له قانونًا بمزاولة أنشطتك/ أنشطته المهنية.
1.4 أنت توافق على أن المواد المتاحة من خلال خدماتنا هي لأغراض العلم أو تسهيل أنشطة المستخدم فقط، ولا تعتبر بديلاً عن الاستشارة الطبية المهنية. وتُقدم المعلومات والخدمات على الموقع الإلكتروني فقط للأنشطة المتعلقة بالمهن الطبية، وليس الغرض منها أن تُقدم بشكل مباشر للمرضى. ولا تتحمل "صحتك تهمنا" ومرخيصها ومورديها مسؤولية أي انتهاكات لحالات الإفصاح عن المحتوى المتاح على الموقع الإلكتروني لأي أطراف ثالثة، بما في ذلك على سبيل المثال لا الحصر المرضى.
2.  الترخيص
2.1 من خلال استخدام خدماتنا، نمنحك بموجب هذا حقًا محدودًا وقابلاً للإلغاء وغير حصريًا وغير قابلاً للترخيص من الباطن في: (1) الولوج إلى تطبيقنا الإلكتروني أو الموقع الإلكتروني وتحميلهما واستخدامهما لغرض وحيد وهو استخدام خدماتنا، و(2) الاطلاع على المعلومات والمواد المقدمة أو المتاحة أو الموجودة بأي طريقة أخرى على المحتوى الخاص بنا واستخدامها.
2.2 هذا الترخيص لا يُقصد به أن يتم التنازل عنه من الباطن، أو بيعه، أو تأجيره، أو استئجاره، أو تصديره، أو استيراده، أو توزيعه، أو نقله، أو منحه بأي طريقة أخرى لأطراف ثالثة. وهو غير مخصص للاستخدام التجاري. وأنت مصرح لك بالاستفادة من خدماتنا للاستخدام الشخصي وغير المربح وغير التجاري فقط.
2.3  لا يحق لك استكشاف ضعف أي نظام أو شبكة أو فحصه أو اختباره أو اللجوء إلى أي وسيلة أخرى للالتفاف حول الإجراءات الأمنية أو إجراءات التحقق؛ أو الحصول على مجالات الخدمة غير العامة أو مجالات الخدمة المشتركة التي لم تتم دعوتك بشأنها أو التلاعب بها أو استخدامها، أو النظم الحاسوبية الخاصة بصحتك تهمنا أو مقدمي الخدمات التابعين لصحتك تهمنا؛ أو التشويش أو عرقلة أي مستخدم أو مضيف أو شبكة، على سبيل المثال من خلال إرسال فيروس إلكتروني، أو التحميل الزائد، أو فيض الرسائل، أو الرسائل الإلكترونية غير المرغوب فيها، أو قصف البريد الإلكتروني لأي جزء من الخدمات؛ أو زرع برمجيات خبيثة أو خلافه من خلال استخدام الخدمات في نشر البرمجيات الخبيثة أو الولوج إلى الخدمات أو البحث عنها بأي وسيلة أخرى بخلاف واجهاتنا المدعومة للجمهور (على سبيل المثال "تجريف الويب")؛ أو إرسال رسائل غير مرغوب فيها، أو إعلانات ترويجية، أو إعلانات دعائية أو رسائل إلكترونية تطفلية، أو إرسال معلومات زائفة أو مضللة أو معدلة، بما في ذلك رسائل التصيد الاحتيالي (رسائل الدعاية الساخرة)؛ أو نشر أي مواد مزيفة أو مضللة أو تنتهك حقوق الآخرين: أو الترويج أو الدعاية لمنتجات أو خدمات بخلاف منتجاتك وخدماتك بدون الحصول على التصريح اللازم؛ أو انتحال شخصية أو تشويه انتمائك لشخص أو كيان ما: أو نشر أو مشاركة مواد تعتبر غير قانونية أو إباحية أو غير لائقة أو تدعو إلى التعصب أو الكراهية الدينية أو العنصرية أو العرقية أو تنتهك القانون بأي طريقة أخرى أو خصوصية الآخرين أو تشوه سمعة الآخرين.
3.  القيود
3.1  لا يحق لمقدمي الخدمات استكشاف ضعف أي نظام أو شبكة أو فحصه أو اختباره أو اللجوء إلى أي وسيلة أخرى للالتفاف حول الإجراءات الأمنية أو إجراءات التحقق؛ أو الحصول على مجالات الخدمة غير العامة أو مجالات الخدمة المشتركة أو التلاعب بها أو استخدامها، أو النظم الحاسوبية الخاصة بصحتك تهمنا أو مقدمي الخدمات التابعين لصحتك تهمنا؛ أو التشويش أو عرقلة أي مضيف أو شبكة، أو التحميل الزائد، أو فيض الرسائل، أو الرسائل الإلكترونية غير المرغوب فيها، أو قصف البريد الإلكتروني لأي جزء من الخدمات؛ أو زرع برمجيات خبيثة أو خلافه من خلال استخدام الخدمات في نشر البرمجيات الخبيثة أو الولوج إلى الخدمات أو البحث عنها بأي وسيلة أخرى بخلاف واجهاتنا المدعومة للجمهور؛ أو إرسال رسائل غير مرغوب فيها، أو إعلانات ترويجية، أو إعلانات دعائية أو رسائل إلكترونية تطفلية، أو زرع معلومات زائفة أو مضللة، بما في ذلك رسائل التصيد الاحتيالي (رسائل الدعاية الساخرة)؛ أو نشر أي مواد مزيفة أو مضللة أو تنتهك حقوق الآخرين: أو الترويج أو الدعاية لمنتجات أو خدمات بخلاف منتجاتهم وخدماتهم؛ أو مشاركة مواد غير قانونية أو غير لائقة أو تشهيرية، أو مشاركة محتوى يدعو إلى التعصب أو الكراهية الدينية أو العنصرية أو العرقية.
3.2 مع مراعاة هذه الشروط، تُمنح بموجب هذا حقًا محدودًا وقابلاً للإلغاء وغير حصريًا لاستخدام المحتوى والمواد المتاحة على التطبيق في السياق العادي لاستخدام التطبيق. ولا يجوز لك استخدام حقوق الملكية الفكرية للغير بدون الحصول على إذن خطي صريح من الغير فيما عدا ما يسمح به القانون.
4. تسجيل مقدم الخدمة وكلمات المرور
4.1 من أجل الحصول على ميزات مقدم الخدمة المتعلقة بالخدمات، يتعين عليك التسجيل لدى "صحتك تهمنا" وإنشاء حساب من خلال اتباع عملية التسجيل الإلكترونية على الموقع الإلكتروني. ويتيح لك حسابك الحصول على الخدمات والعمليات التي قد ننشأها ونديرها من حين لآخر ووفق تقديرنا المطلق. ومن خلال إنشاء الحساب، يجب أن تقدم لصحتك تهمنا معلومات دقيقة وكاملة على النحو المبين في استمارة التسجيل. ويتعين عليك إخطار "صحتك تهمنا" فورًا في حال تغيرت هذه المعلومات. وإذا لم تقدم أو تُحدّث هذه المعلومات، يجوز لصحتك تهمنا وفق تقديرها الخاص إنهاء حقك في استخدام التطبيق أو الخدمات.
4.2 إذا كنت تتعامل مع صحتك تهمنا لأول مرة وأدخلتَ بياناتك على النحو الواجب، يُرجى منك التواصل مع صحتك تهمنا لفتح حساب لممارستك, ومن أجل استخدام خدماتنا، يتعين عليك التوقيع على ("اتفاقية "مقدم الخدمة") حيث تتعهد بالامتثال قانونًا لهذه الشروط وتحميل تطبيقنا على الهاتف المحمول. بالإضافة إلى ذلك، يجب عليك تقديم التصاريح والشهادات والتراخيص التي تثبت أنك مخول على النحو الواجب لممارسة مهنة الطب، إلى جانب معلوماتك الشخصية (وكذلك "ملفك") لصحتك تهمنا. وتمنح صحتك تهمنا، بموجب هذا، الترخيص الحصري وقابل للتحويل وقابل للترخيص من الباطن وبدون أي رسوم والدائم وغير قابل للإلغاء في استخدام ملفك، واستنساخه، ونشره، وترجمته، وترخيصه من الباطن، ونسخه، وتعديله، وحذفه، وتطويره، وتوزيعه، وإدراج الملف نفسه على منصتنا.
4.3 عندما تفتح حسابك، سوف يُطلب منك اختيار كلمة مرور. ويجب أن تحافظ على سرية كلمة مرورك، ويتعين عليك ألا تستجيب تحت أي ظرف من الظروف لطلب الحصول على كلمة مرورك، وخاصة إذا كان هذا الطلب من فرد يدعي أنه أحد موظفي صحتك تهمنا. ولن يطلب موظفو صحتك تهمنا الحصول على كلمة مرورك أبدًا. ويجب أن تُخطر صحتك تهمنا في حال تلقيت مثل هذا الطلب.
4.4 تعتبر مسؤولاً عن أي استخدام لكلمة مرورك وحسابك، بما في ذلك لا الحصر أي استخدام من جانب طرف ثالث غير مصرح له. ويجب عليك إخطار صحتك تهمنا فورًا إذا كنت تظن أن شخص أو كيان غير مصرح له قد حصل على كلمة مرورك أو حسابك أو ولج إليهما أو استخدمهما. علاوة على ذلك، يجب أن تُخطر صحتك تهمنا فورًا في حال أصبحت على علم بأي خرق أو محاولة خرق لأمن التطبيق.
 4.5 تتحمل المسؤولية عن أي نشاط يستخدم حسابك، سواء أذنتَ بهذا النشاط أم لا. وأنت تُقر بأنك إذا كنت ترغب في حماية نقل بياناتك أو ملفاتك إلى صحتك تهمنا، فأنت مسؤول عن استخدام اتصال مشفر وآمن للحصول على الخدمات واستخدامها. وستؤدي فشل عملية تسجيل الدخول ثلاث مرات متتالية إلى تعليق معلومات تسجيل الدخول الخاصة بك، وهو ما يُحتم عليك التواصل مع فيزيتا عبر البريد الإلكتروني لإعادة التحقق من حسابك.
4.6 لقد اتخذنا تدابير تقنية وتنظيمية معقولة تجاريًا مُصممة لحماية أمن معلوماتك الشخصية من الفقدان العرضي والوصول والاستخدام غير المصرح به أو التعديل أو الإفصاح عنها. مع ذلك، لا يمكننا ضمان أن الأطراف الثالثة غير المصرح لهم لن يتمكنوا من اختراق هذه التدابير أو استخدام معلوماتك الشخصية لأغراض غير مشروعة. وأنت تُقر بأنك تُقدم معلوماتك الشخصية على مسؤوليتك الشخصية.
4.7 يجب أن تأخذ بعين الاعتبار ما يلي:
• يجب أن تكون بياناتك الشخصية وتصاريحك وتراخيصك دقيقة وكاملة ومُحدثة في جميع الأوقات. وفي حالة الإخفاق في فعل ذلك، أنت تُقر بأنه يحق لصحتك تهمنا إنهاء استخدامك للخدمات.
• يجب أن تختار كلمة مرور للولوج إلى حساب المستخدم الخاص بك، ويجب أن تحافظ على سرية كلمة المرور في جميع الأوقات.
• أنت توافق على أنك مسؤولاً عن أي أفعال/ نشاطات تجريها أطراف ثالثة غير مصرح لهم على حساب مقدم الخدمة الخاص بك. وينبغي أن تُخطرنا إذا كنت تعتقد اعتقادًا راسخًا بأنه قد تم اختراق حسابك.
• يجب ألا تستجيب تحت أي ظرف من الظروف لطلب الحصول على كلمة مرورك، وخاصة إذا كان هذا الطلب من شخص يدعي أنه أحد موظفي صحتك تهمنا.
• لا يحق لك تفويض حساب مقدم الخدمة الخاص بك أو إحالته أو نقله للغير.
• أنت توافق على أنك ستُمنع من الولوج إلى حسابك في حال فشلت في إدخال كلمة مرورك مرتين متتاليتين.
5. الموافقة على الرسائل الواردة من صحتك تهمنا
5.1 من خلال التسجيل كمقدم خدمة وتزويد صحتك تهمنا بعنوان بريدك الإلكتروني، أنت توافق على استخدامنا لعنوان بريدك الإلكتروني لإرسال الإشعارات المتعلقة بالخدمات إليك، ومنها أي إشعارات يقتضيها القانون، أو تغييرات في الميزات والعروض الخاصة بدلاً من التواصل عبر البريد. ويجوز لك عدم قبول الرسائل الإلكترونية المتعلقة بالخدمات من خلال إلغاء هذه الخاصية.
6. مواقع الأطراف الثالثة
6.1 قد يحتوي التطبيق على روابط لمواقع الأطراف الثالثة أو شركات الإعلانات أو الخدمات التي لا تملكها "صحتك تهمنا" أو تخضع لرقابتها. ولا تتحكم "صحتك تهمنا" ولا تتحمل مسؤولية أي محتوى، أو سياسات خصوصية، أو ممارسات خاصة بأي من مواقع الأطراف الثالثة أو خدماتها، ولا تسري سياسة الخصوصية التي تعتمدها صحتك تهمنا على استخدامك لهذه المواقع. وفي حال ولجتَ إلى أحد المواقع الإلكترونية من الموقع الإلكتروني الخاص بصحتك تهمنا، فسوف تتحمل مسؤولية ذلك. وأنت تُعفي "صحتك تهمنا" صراحة من أي مسؤولية تنشأ عن استخدامك لأي من مواقع الأطراف الثالثة أو خدماتها أو المحتوى الذي تملكه الأطراف الثالثة. فضلاً عن ذلك، تعتبر أي تعاملات أو المشاركة في الإعلانات الترويجية لشركات الإعلان الموجودة على الموقع الإلكتروني، بما في ذلك الدفع وتسليم السلع وأي شروط أخرى (مثل الضمانات)، أمرًا محصورًا بينك وبين شركات الإعلان فقط. وأنت توافق على أن "صحتك تهمنا" لا تتحمل مسؤولية أية أضرار أو خسائر تنشأ من تعاملاتك مع شركات الإعلان تلك.
7. المحتوى الذي ينتجه مقدم الخدمة
7.1 من خلال استخدام خدماتنا، أنت تزودنا بمعلومات وملفات ومجلدات تقدمها لصحتك تهمنا (يُشار إليها مجتمعة بـ "ملفك"). ومن خلال نشر أو تخزين أو نقل أي محتوى على التطبيق أو إليه، بما في ذلك عن طريق تقديم المحتوى الذي ينتجه مقدم الخدمة على الموقع الإلكتروني، أنت تقبل بمنح "صحتك تهمنا" أو تمثيل أو ضمان أن صاحب هذا المحتوى قد منح "صحتك تهمنا" صراحة حقًا وترخيصًا حصريًا وقابلاً للتحويل وقابلاً للترخيص من الباطن وخاليًا من أي رسوم ودائمًا وغير قابلاً للإلغاء لاستخدام هذا المحتوى، واستنساخه، ونشره، وترجمته، وترخيصه من الباطن، ونسخه، وتعديله، وحذفه، وتطويره ونشره من أجل إدراج المحتوى ذاته على منصة "صحتك تهمنا"، بما في ذلك على سبيل المثال لا الحصر الموقع الإلكتروني الخاص بصحتك تهمنا. ويشمل هذا الإدراج معالجة المحتوى، بما في ذلك على سبيل المثال لا الحصر المنتجات أو الميزات أو الصور المصغرة أو معاينة المستند، أو خيارات التصميم التي نتخذها لإدارة خدماتنا تقنيًا، على سبيل المثال كيف ننشأ نسخ احتياطية للبيانات بشكل متكرر لحماية أمنها. وأنت تمنحنا التصاريح التي نحتاجها للقيام بكافة الإجراءات الواردة أعلاه لغرض وحيد وحصري وهو تقديم الخدمات وتطويرها. ويمتد هذا التصريح أيضًا ليشمل الأطراف الثالثة الموثوقين.
7.2 أنت تُقر بأن استخدام "صحتك تهمنا" للمحتوى على منصة "صحتك تهمنا" لا يشكل انتهاكًا لحقوق الملكية الفكرية أو حقوق الطبع والنشر أو العلامات التجارية التي تملكها. وتُقر "صحتك تهمنا" بالحصول على موافقتك المسبقة للإفصاح عن أي محتوى على أي منصات أخرى بخلاف منصة "صحتك تهمنا. وفي حالة رفض المستخدم الموافقة على هذا الإفصاح، يمنع هذا الرفض "صحتك تهمنا" من الإفصاح عن المحتوى. وتحتفظ بالملكية الكاملة لملفك أو الصيغة التي يُنشأ بها من قبل "صحتك تهمنا" باعتباره المحتوى الذي ينتجه مقدم الخدمة.
7.3 أنت تفهم وتوافق على أن العلاقة التي أُقيمت بينك وبين "صحتك تهمنا" هي عبارة عن اتفاقية إدارة لجمع البيانات، والحصول عليها، واستحواذها، ونقلها، ومعالجتها، ودمجها وترحيلها، وأنك قدمت تلك البيانات لصحتك تهمنا لهذا الغرض. وبصرف النظر عن الاستثناءات النادرة التي نوضحها في سياستنا بشأن الخصوصية، وبصرف النظر عن مدى تغير الخدمات، نحن لا نُطلع السلطات المعنية بإنفاذ القانون على المحتوى الخاص بك لأي غرض، إلا إذا أصدرتَ لنا تعليمات بذلك. وأنت المسؤول الوحيد عن دقة الملفات أو المنشورات أو أي معلومات أخرى تقدمها لصحتك تهمنا واستيفائها وصحتها وقانونيتها. وتقدم الخدمات ميزات تتيح لك مشاركة محتواك مع الأشخاص الآخرين الذين يعملون تحت إشرافك، وهو ما يسمح لهم بالاطلاع على ملف المحتوى، ونسخ المحتوى أو تعديله أو حتى مشاركته. لذلك، ننصحك بتوخي الحذر مع المحتوى الذي تشاركه مع موظفينك. وأنت تُقر وتوافق، بموجب هذا، على أنه يحق لـ"صحتك تهمنا" الاحتفاظ بملفك الشخصي المتاح عبر منصة "صحتك تهمنا" حتى بعدما لم يعد بإمكانك الحصول على خدمات "صحتك تهمنا" أو استخدامها.
8. المحتوى الذي تنشأه "صحتك تهمنا"
8.1 يشمل المحتوى الذي تنشأه "صحتك تهمنا" جميع المواد المتاحة على التطبيق من خلال الخدمات، بما في ذلك على سبيل المثال لا الحصر الشعارات والتصميم والنصوص ورسومات الجرافيك، إلى جانب اختيارها وترتيبها وتنظيمها. ويشمل المحتوى أيضًا أسماء منتجات "صحتك تهمنا" وشعاراتها وتصميماتها وتسمياتها.
8.2 علاوة على ذلك، يغطي المحتوى الذي تنشأه "صحتك تهمنا" جميع رؤوس الصفحات، أو رسومات الجرافيك المصممة خصيصًا، أو الأيقونات، أو النصوص، أو العلامات التجارية أو اللباس التجاري الخاص بصحتك تهمنا. وإذا استخدمتَ هذا المحتوى، يجب أن يشمل التخصيص المناسب. وتعتبر جميع العلامات التجارية الأخرى أو الأسماء التجارية وما شابه ذلك والتي تظهر على التطبيق ملك لمالكي كل منها. ولا يحق لك استخدام أي من العلامات التجارية أو اللباس التجاري أو الأسماء التجارية أو أي علامات أو لباس أو أسماء مماثلة بشكل محير بدون الحصول على موافقة خطية مسبقة وصريحة من "صحتك تهمنا" أو ملكيتها.
8.3 يجوز لك اختيار أو يجوز لنا دعوتك لتقديم تعليقات وشهادات وملاحظات واقتراحات وأفكار وغيرها من الآراء حول الخدمات، بما في ذلك على سبيل المثال لا الحصر كيفية تطوير الخدمات أو منتجاتنا ("الأفكار"). ومن خلال تقديم أي فكرة، أنت تُقر بأن كشفك عن هذه الفكرة يعتبر مجاني وغير ملتمس، ولن يضع "صحتك تهمنا" تحت أي التزامات ائتمانية وغيرها من الالتزامات المتعلقة بها، وأنه يحق لـ "صحتك تهمنا" الكشف عن الأفكار استنادًا إلى عدم السرية لأي شخص أو غير ذلك لاستخدام الأفكار بدون دفع أي تعويض إضافي لك. ويشكل الإفصاح عن أي أفكار أو تقديمها أو عرضها ترخيصًا وملكية ومصلحة دائمة وخالية من أي رسوم وعالمية وغير قابلة للإلغاء في جميع براءات الاختراع وحقوق الطبع والنشر والعلامات التجارية وجميع حقوق الملكية الفكرية الأخرى وغيرها من الحقوق المتعلقة بالأفكار مهما كانت طبيعتها، وتنازلاً عن أي مطالبة تستند إلى الحقوق الأدبية والمنافسة غير المنصفة وأي أساس قانوني آخر. ولا يتعين عليك تقديم أية أفكار لنا إذا كنت لا ترغب في منحنا ترخيصًا بهذه الحقوق. وتعتبر المسؤول الوحيد عن محتوى أي أفكار تصنعها، وسوف تظل كذلك.
9. المسؤوليات التي تقع على عاتقك
9.1 يجوز حماية المحتوى الآخر في الخدمات من خلال حقوق الملكية الفكرية للآخرين، ويعتبر هذا المحتوى سري. ويُرجى ألا تنسخ هذه الملفات أو ترفعها أو تُحمّلها أو تشاركها. وتعتبر المسؤول الوحيد عن المواد التي تنسخها أو تشاركها أو ترفعها أو تُحملها أو أي طريقة أخرى أثناء استخدامك للخدمات.
9.2 تتحمل المسؤولية الكاملة عن الحفاظ على جميع بياناتك وحمايتها وضمان سلامتها. ولا تعتبر "صحتك تهمنا" مسؤولة عن أي فقدان لبياناتك أو تلفها، أو أي تكاليف أو نفقات تتصل بصنع نسخ احتياطية من بياناتك أو استعادتها، أو التعويض عن أي أضرار تلحق بك بسبب انعدام الحماية لبياناتك.
9.3 لا يحق لك استخدام الخدمات في إبرام أي اتفاقية أو محاولة إبرامها أو تنفيذها أو محاولة تنفيذها، أو تنسيق أسعار أي منتج أو خدمة تقدمها "صحتك تهمنا" أو تواترها أو كمياتها، أو التدخل بأي طريقة أخرى أو محاولة التدخل في تحديد الأسعار أو تقييد الإنتاج أو تقاسم العملاء أو الأسواق. لا يحق لك استخدام الخدمات، سواء بشكل مباشر أو غير مباشر، للنخراط في أي ممارسات غير عادلة أو مضللة أو مناهضة للمنافسة، أو مخالفة بأي طريقة أخرى القوانين أو اللوائح المتعلقة بحماية العملاء أو المنافسة أو مكافحة الاحتكار المعمول بها.
9.4 توفر "صحتك تهمنا" خدمات يسهل الوصول إليها على آلات وأجهزة مختلفة، بما في ذلك على سبيل المثال لا الحصر، بعض الهواتف المحمولة وأجهزة الحاسب الآلي التي ستُوفرها. ولا تقع على "صحتك تهمنا" مسؤولية توفير الأجهزة المطلوبة أو مرافق الاتصالات السلكية واللاسلكية، أي الاتصال بشبكة الإنترنت أو خدمة الاتصالات.
10. المبالغ المردودة
10.1 تعتبر الرسوم التي تدفعها نهائية وغير قابلة للاسترداد ما لم تقرر "صحتك تهمنا" خلاف ذلك.
 10.2 يُرد المبلغ من خلال طريقة الدفع ذاتها، إن وجدت.
10.3 تحتفظ "صحتك تهمنا" بحقها في رد أية مبالغ إلى حساب المستخدمين لاستخدامها في خدمات أخرى وفقًا لتقديرها المطلق.
10.4 لا ينطبق رد المبالغ في حال كان المستخدم غير راضٍ عن الخدمة الطبية المقدمة.
10.5 يحق للمستخدم استرداد كامل المبلغ الذي دفعه في حالة اذا قامت المؤسسة الطبية بإلغاء الخدمة المقدمة التي دفع المستخدم رسومها


11. سرية المستخدم
11.1 نحن نعتبر خصوصية وسرية البيانات الشخصية لمستخدمينا أمر مقدس. مع ذلك، نحن نفهم طبيعة الخدمة التي تُقدمها ومدى أهمية وضرورة أن تُحدد معلومات شخصية معينة.
11.2 لذلك، نتيح لك بموجب هذا إمكانية الوصول إلى البيانات التي تعتبر ضرورية لتنفيذ خدماتك، وتحديدًا أسماء المستخدمين وأرقام هواتفهم وعناوين بريدهم الإلكتروني. مع ذلك، يُمارس حق الوصول إلى البيانات لغرض وحيد وهو تعزيز العمليات الداخلية وليس لأغراض ترويجية.
11.3 في حالة الإخلال بما سبق، تُقر بأنك تعتبر مسؤولاً وتدافع عن "صحتك تهمنا" وتحميها وتعوضها وتبرئها من أي مسؤولية تجاه كافة المطالبات أو الإجراءات أو الدعاوى التي تنشأ عن الأضرار أو الخسائر أو الإصابات أو التكاليف أو النفقات مهما كان نوعها والتي تلحق بالمستخدمين بسبب كشف مقدم الخدمة عن معلوماتهم الشخصية.
12. الملكية الفكرية
12.1 تحترم "صحتك تهمنا" حقوق الملكية الفكرية للغير، وتنتظر من مستخدميها أن تحذو حذوها. ويجوز لصحتك تهمنا حذف المحتوى الذي ترى وفقًا لتقديرها المطلق أنه ينتهك حقوق الملكية الفكرية للغير. بالإضافة إلى ذلك، يحق لصحتك تهمنا وفقًا لسلطتها التقديرية غلق حسابات المستخدمين الذين ينتهكون حقوق الملكية الفكرية للغير. وفي حال كنت تعتقد أن أحد مستخدمي التطبيق أو الخدمات قد انتهك حقوق الطبع والنشر أو العلامات التجارية الخاصة بك أو بالغير، يُرجى إخطار "صحتك تهمنا" بذلك من خلال البريد الإلكتروني أو عن طريق التواصل مع قسم الشؤون القانونية التابع لصحتك تهمنا.
12.2 تحتفظ "صحتك تهمنا" بملكية حقوق الملكية الفكرية المملوكة لها، ولا يجوز لك الحصول على أي حقوق في هذا الصدد باستثناء ما تنص عليه موافقة خطية صراحة. ولا يحق لك استخدام، أو نسخ، أو عرض، أو تنفيذ، أو إنشاء أعمال مشتقة، أو توزيع، أو نقل، او ترخيص من الباطن أي مواد أو محتويات متاحة على التطبيق باستثناء ما قد يكون ضروريًا بالقدر المعقول لاستخدام الخدمات للأغراض المقصودة منها وفي حدود ما تنص عليه هذه الشروط صراحة. ولا يجوز لك محاولة عكس هندسة التكنولوجيا المستخدمة في توفير الخدمات. وإذا ترائ لك أي تصرف يمثل انتهاكًا لهذه الشروط، يُرجى التواصل مع "صحتك تهمنا" وإخطارها بذلك.
12.3 ربما تحتوي منصتنا على روابط لمواقع أو إعلانات أو خدمات مملوكة للغير والتي لا تملكها "صحتك تهمنا". وأنت تُقر وتوافق على أن هذا المحتوى يجوز أن يخضع لشروط استخدام وسياسات خصوصية مختلفة عن شروط الاستخدام وسياسات الخصوصية التي تطبقها "صحتك تهمنا". ولذلك، لا تنطبق عليك الشروط الحالية عند الحصول على خدمات الغير أو استخدامها. وفي حال ولجتَ إلى مواقع الغير من خدماتنا، فأنت تقوم بذلك على مسؤوليتك الشخصية، وتوافق على إعفاء "صحتك تهمنا" من كافة المسؤوليات التي تنشأ عن هذا الاستخدام.
13. التمثيلات والضمانات
13.1  أنت تُقر وتتعهد لصحتك تهمنا بأن: (1) أنك تتمتع بكامل الصلاحيات للدخول في الالتزامات التي تنص عليها هذه الشروط وأدائها؛ (2) أن موافقتك على الالتزامات التي تقع على عاتقك بموجب هذه الشروط وأدائها لا تشكل انتهاكًا أو تعارضًا مع أي التزامات قانونية أخرى، أو اتفاقيات، أو ترتيبات، أو أي قوانين أو لوائح أو قواعد معمول بها، أو أي أحكام أو قرارات قضائية ملتزم بتنفيذها؛ (3) هذه الشروط تشكل التزامات قانونية وصحيحة ومُلزمة لك وتعتبر سارية المفعول طبقًا للشروط والأحكام؛ (4) لا يحق لك انتهاك حقوق الطبع والنشر، أو العلامة التجارية، أو الأسرار التجارية، أو حق الدعاية أو أي حقوق ملكية فكرية أخرى يملكها أي طرف ثالث أثناء استخدام الموقع الإلكتروني أو الخدمات، أو حق خصوصية عملائك/ مرضاك؛ (5) أنك تتعهد بالامتثال لكافة القوانين واللوائح والقواعد السارية فيما يتعلق باستخدامك للخدمات والموقع الإلكتروني، ومنها هذه الشروط؛ (6) أنك طبيب مؤهل على النحو الواجب في مجال (مجالات) ممارستك.
14. إخلاء المسؤولية من الضمان
14.1 أنت توافق على أنك المسؤول الوحيد عن استخدامك للتطبيق. وتتنصل "صحتك تهمنا" ومسؤوليها ومدرائها وموظفيها ووكلائها ومساهميها من المسؤولين عن كافة الضمانات، سواء كانت ضمانات صريحة أو ضمنية، فيما يتعلق بالخدمات واستخدامك لها.
14.2 لا تضمن "صحتك تهمنا"، إلى أقصى حد يسمح بها القانون، أو توافق أو تتحمل المسؤولية عن أي منتجات أو خدمات يعلن عنها أو يوفرها الغير من خلال الخدمات أو الخدمات ذات الارتباط التشعبي التي تُعرض في أي لافتات أو أي وسيلة إعلان أخرى، وأن "صحتك تهمنا" لن تكون طرفًا أو مسؤولة بأي طريقة أخرى عن مراقبة أي معاملات بينك وبين الغير.




15. حدود المسؤولية
15.1 أنت توافق على أنك تعتبر مسؤول عن توفير العلاج الطبي الدقيق والمهني للمستخدم والذي يقدمه مقدمي الرعاية الصحية المؤهلين وذوي المهارات العالية.
15.2 وفقًا لذلك، لا تعتبر صحتك تهمنا"، تحت أي ظرف من الظروف، مسؤولة لا عن عدم رضا المستخدم حيال الاستشارة والفحص الطبي الذي أُجري من طرفك، ولا استيائه بشأن تجربته معك بشكل عام.
15.3  لا يجوز في أي حال من الأحوال، وبالقدر الذي يجيزه القانون، أن تكون "صحتك تهمنا" أو مسؤوليها أو مدرائها أو موظفيها أو وكلائها مسؤولين أمامك عن أية أضرار مباشرة أو غير مباشرة أو عرضية أو خاصة أو جزائية أو تبعية مهما كانت والتي تنشأ عن أو تنتج عن أو تتصل بـ (1) أي أخطاء أو هفوات أو عدم دقة المحتوى، (2) أي أضرار أو إصابات شخصية مهما كانت طبيعتها والتي تنجم عن وصولك إلى خدماتنا أو استخدامك لها، (3) الولوج غير المصرح به أو استخدام خوادمنا الآمنة، و/أو كافة المعلومات الشخصية، و/أو المعلومات المالية المخزنة في تلك الخوادم، (4) أي انقطاع أو وقف الإرسال من خدماتنا وإليها، (5) أي برامج خبيثة أو فيروسات إلكترونية أو فيروس حصان طروادة وما شابه ذلك التي قد تُنقل إلى خدمتنا أو من خلالها من قبل الغير، (6) أي أخطاء أو إغفالات في أي محتوى، أو أي خسائر أو أضرار متكبدة نتيجة لاستخدامك لأي محتوى منشور أو مُرسل عبر البريد الإلكتورني أو منقول أو متاح بأي طريقة أخرى من خلال الخدمات، سواء استنادًا إلى أي ضمان، أو عقد، أو مسؤولية أو أي نظرية قانونية أخرى، وسواء ما إذا كانت الشركة قد حذرت بشأن احتمالية حدوث تلك الأضرار. ويعتبر حد المسؤولية السابق ذكره ساري بالقدر الذي يجيزه القانون.
15.4 أنت تُقر صراحة بأن "صحتك تهمنا" ليست مسؤولة عن أي تصرفات تشهيرية أو مسيئة أو غير قانونية من جانب الغير، وأن المسؤولية عن الأخطار أو الأضرار الناجمة من التصرفات سالفة الذكر تقع بالكامل على عاتقك.
15.5 علاوة على ذلك، توفر "صحتك تهمنا" الخدمات وتديرها من منشآتها. ولا تقدم "صحتك تهمنا" أي إقرارات تفيد بأن الخدمة ملائمة أو متاحة للاستخدام في مواقع أخرى. ويقوم الأشخاص الذين يحصلون على الخدمة أو يستخدمونها من مواقع أخرى بذلك على مسؤوليتهم الشخصية، وهم المسؤولون عن الامتثال لقانونها المحلي.


16. التعويض
16.1  أنت توافق، بالقدر الذي يجيزه القانون المعمول به، على الدفاع عن "صحتك تهمنا" وممثليها ومسؤوليها ومدرائها وموظفيها ووكلائها ومساهميها ("الأطراف المستلمة للتعويض") وتعويضهم وتبرئتهم من المسؤولية عن أية أضرار أو خسائر أو تكاليف أو نفقات (بما في ذلك على سبيل المثال لا الحصر أتعاب المحامين وتكاليفهم) المتكبدة فيما يتصل بأي مطالبات أو مطالب أو دعاوى التي تُرفع أو تُقام ضد أي من الأطراف المستلمة للتعويض، والتي تنشأ أو تتصل بما يلي: (1) حصولك على الخدمات واستخدامك لها؛ (2) انتهاك أي شرط من هذه الشروط من طرفك؛ (3) ادعاء حقائق أو ظروف تشكل انتهاكًا من طرفك لأية أحكام واردة في هذه الشروط، ومنها انتهاكات القانون أو مزاعم تتعلق بانتهاك الخصوصية أو الدعاية، أو حقوق الملكية الفكرية المتعلقة بالمحتوى الذي يُنشأه المستخدم والذي تقدمه أو المحتوى الذي تنشأه "صحتك تهمنا"؛ (4) ما ينشأ أو يتصل باستخدامك للموقع الإلكتروني أو الخدمات والذي يشكل انتهاكًا لأي من حقوق الغير، بما في ذلك على سبيل المثال لا الحصر أي حقوق للتأليف والنشر، أو حقوق الملكية، أو حق الخصوصية؛ (5) استخدام الغير ووصوله إلى الخدمات من خلال استخدام اسم المستخدم الخاص بك، أو كلمة مرورك، أو أي رمز سري آخر.
16.2 في حال كنتَ مُلزمًا بدفع تعويضات بموجب هذا الحكم، يجوز لصحتك تهمنا، وفقًا لتقديرها المطلق والحصري، التحكم في التصرف في أي مطالبة على نفقتك الخاصة. ودون المساس بما تقدم، لا يجوز لك تسوية أي مطالبة، أو التوصل إلى حل وسط بشأنها، أو التصرف فيها بأي طريقة أخرى بدون الحصول على موافقة خطية مسبقة من "صحتك تهمنا".
16.3 أنت تُقر وتتعهد بالدفاع عن "صحتك تهمنا" ومسؤوليها وموظفيها وحمايتهم وتعويضهم وتبرئة ذمتهم من كافة المطالبات أو الإصابات أو الأضرار أو الخسائر أو الدعاوى القانونية التي تشمل أتعاب المحاماة، والتي تنشأ أو تنجم عن أو تتصل بأي تصرفات احتيالية أو خادعة أو مضللة أو تتعلق بالتزوير أو تعتبر غير قانونية بشكل عام ترتكبها مهما كانت الأسباب.
16.4 على مقدم الخدمة الدفاع عن "صحتك تهمنا" ومسؤوليها وموظفيها وتعويضهم وتبرئة ذمتهم من كافة المطالبات أو الإصابات أو الأضرار أو الخسائر أو الدعاوى القانونية التي تشمل أتعاب المحاماة، والتي تنشأ أو تنجم عن أو تتصل بأية تصرفات أو أخطاء أو إغفالات من قبل المستخدم.
16.5 بالإضافة إلى ذلك، أنت تُقر بأنك تتحمل المسؤولية الكاملة عن دقة تشخيص المريض الذي تعاملت معه من خلال خدمات "صحتك تهمنا" أو العلاج الذي قدمته له. ولا يجوز مساءلة "صحتك تهمنا"، تحت أي ظرف من الظروف، وتحميلها المسؤولية عن أي خطأ طبي، أو سوء ممارسة المهنة، أو الإهمال الجسيم الذي يرتكبه الطبيب، بما أن "صحتك تهمنا" هي وحدها من تمارس دور الطرف الوسيط بين المؤسسة الطبية والمريض.

17. القوة القاهرة
17.1 لا تعتبر "صحتك تهمنا" مسؤولة عن عدم الوفاء بالتزاماتها المنصوص عليها في هذه الشروط في حالة وقوع أي حدث خارج عن سيطرتها المعقولة، بما في ذلك على سبيل المثال لا الحصر الحرائق، أو الأعمال الإرهابية، أو الكوارث الطبيعية، أو الحروب، أو المقاطعات، أو اضطرابات العمال، أو انقطاع الإنترنت أو الاتصالات، أو انقطاع الخدمة، أو عدم وفاء أحد مقدمي الخدمات التابعين لصحتك تهمنا في الوفاء بالتزاماته.
18. الإنهاء والفسخ
18.1 يحق لصحتك تهمنا، وفقًا لتقديرها المطلق ولأي سبب، إنهاء حسابك أو وصولك للتطبيق أو الخدمات، بدون أي مسؤولية تجاهك أو الغير. وقد تشمل هذه الأسباب، على سبيل المثال لا الحصر: (1) انتهاكك لأي جزء من هذه الشروط؛ (2) انتهاكك لحقوق الغير؛ (3) عدم سريان بطاقتك الائتمانية، أو تجاوز الحد الائتماني للبطاقة، أو "تحمّل" أي رسوم أو مدفوعات أخرى؛ (4) عدم نشاط حساب مقدم الخدمة الخاص بك لفترة زمنية طويلة.
18.2 أثر إنهاء الحساب: إذا تم إنهاء حسابك، يجوز لصحتك تهمنا وفقًا لتقديرها المطلق حذف أي مواقع أو ملفات أو رسوم بيانية أو أي محتوى آخر أو مواد تتعلق باستخدامك للموقع الإلكتروني أو الخدمات والمتاحة على الخوادم التي تملكها أو تديرها "صحتك تهمنا" أو التي تعتبر بحوزتها بأي طريقة أخرى، ولا تتحمل "صحتك تهمنا" أي مسؤولية عن القيام بذلك تجاهك أو تجاه الغير. ولن يُسمح لك بعد إنهاء الحساب باستخدام الموقع الإلكتروني أو الخدمات. وفي حال تم إنهاء حسابك أو وصولك إلى الموقع الإلكتروني أو الخدمات، تحتفظ صحتك تهمنا" بالحق في اللجوء إلى أي وسيلة تراها ضرورية لمنع الوصول غير المصرح به إلى الموقع الإلكتروني أو الخدمات، بما في ذلك على سبيل المثال لا الحصر الحواجز التقنية وإعادة توجيه عنوان بروتوكول الإنترنت والتواصل المباشر مع مزود خدمة الإنترنت الخاص بك. وفي حال تم إنهاء حسابك، يتعين عليك دفع أية رسوم تدين بها لصحتك تهمنا فورًا، بصرف النظر عما إذا كنت تملك الحق في الوصول إلى الموقع الإلكتروني أو الخدمات أو استخدامهما.
19. أحكام متنوعة
19.1 تشكل هذه الشروط مُجمل الاتفاقية والتفاهم بينك وبين "صحتك تهمنا" بخصوص استخدام التطبيق، وتُلغي أي اتفاقيات وتفاهمات سابقة وحالية مُبرمة بينك وبين "صحتك تهمنا" بشأن موضوع الاتفاقية. وتعتبر هذه الشروط مُلزمة لكل طرف وخلفائه والمتنازل إليهم المصرح لهم. ولا يعتبر إخفاق أحد الطرفين أو تأخره في ممارسة أي حق، أو سلطة، أو امتياز منصوص عليه في هذه الشروط تنازلاً عنه، ولا تمنع أية ممارسة كلية أو جزئية لأي حق أو سلطة أو امتياز الطرف الآخر من الممارسة الإضافية له أو ممارسة أي حق أو سلطة أو امتياز آخر تنص عليه هذه الشروط.
19.2 تعتبر أنت و"صحتك تهمنا" متعاقدون مستقلون. ولا تشكل علاقتك بصحتك تهمنا بأي حال من الأحوال وكالة أو شراكة أو مشروع مشترك أو علاقة بين موظف وصاحب العمل.
19.3 لا يؤثر عدم صحة أي من الأحكام الواردة في هذه الشروط أو عدم قابلتها للنفاذ على صحة أو قابلية إنفاذ أية أحكام أخرى واردة في هذه الشروط، وتعتبر كافة الأحكام نافذة وسارية المفعول.
19.4 تحتفظ "صحتك تهمنا" بالحق في تحديث أو تغيير أو تعديل هذه الشروط في أي وقت ولأي سبب من الأسباب، وذلك عن طريق نشر النسخة المعدلة على التطبيق لكي تسري الشروط المعدلة على جميع خدمات "صحتك تهمنا"، وتصبح سارية المفعول مباشرة بعد نشرها على التطبيق. وبعبارة أخرى، تخضع الخدمة التي تُقدم لك للشروط القائمة في تاريخ تقديم الخدمة. ويعتبر قبولك للشروط بنسختها المعدلة استمرار لوصولك واستخدامك للتطبيق والخدمات الواردة فيها اعتبارًا من تاريخ سريان هذا التعديل.
20. القانون المنظم ومناط الاختصاص القضائي
20.1 تخضع هذه الشروط وتُفسر وفقًا للقوانين المصرية. وأي نزاع ينشأ عن أو يتصل بتفسير هذه الاتفاقية و/أو تنفيذها يُسوى نهائيًا عن طريق التحكيم أمام مركز القاهرة الإقليمي للتحكيم التجاري الدولي ("المركز") طبقًا لقوانين المركز السارية في وقت النزاع. وتتكون هيئة التحكيم من مُحكّم واحد. وتُستخدم اللغة الانجليزية في الإجراءات. وباعتباره استثناء مما سبق، تحتفظ "صحتك تهمنا" بالحق في ممارسة سلطتها التقديرية لمباشرة إجراءات رفع الدعوى أمام إحدى المحاكم التي تمتد صلاحيتها القضائية لتشمل مقدم الخدمة.
                """,
          textAlign: TextAlign.start,
          lineHeight: 1.5,
        ),
      ),
    );
  }
}
